#ifndef _FLAG_H_
#define _FLAG_H_

/* 
	该头文件枚举了该资源管理器中的各种文件类型
	可以通过位运算读出不同的文件类型
	便于后续My_File结构的定义
*/

enum file
{
	THIS_PC = 0, //此电脑
	C_DISK,		 // C盘
	DIC,		 //目录
	/*以下为文件类型*/
	TXT,		 // 0000 0011
	C,			 // 0000 0100
	CPP,		 // 0000 0101
	H,			 // 0000 0110
	OBJ,		 // 0000 0111
	EXE,	  	 // 0000 1000
	JPG,	 	 // 0000 1001
	PNG,	 	 // 0000 1010
	DOC,		 // 0000 1011
	XLS,		 // 0000 1100
	PPT,		 // 0000 1101
	PDF,		 // 0000 1110
	OTHER,		 // 0000 1111
	IS_OPEN = 16,// 0001 0000
	H_NODE = 32, //是否为头节点         0010 0000
	IS_DIR = 64, //判断是否为文件夹     0100 0000
	SELECT = 128 //判断是否选中         1000 0000
};

#endif